backend/app/controllers/api/v1/ai/training_events_controller.rb

        def create
          event = AiTrainingEvent.create!(
            game_id: params[:game_id],
            reward: params[:reward].to_f,
            confidence: params[:confidence].to_f,
            exploration_rate: params[:exploration_rate].to_f,
            mode: params[:mode].presence || "exploring",
            metadata: params[:metadata] || {}
          )
---
INSERT INTO "ai_training_events" ("game_id", "reward", "confidence", "exploration_rate", "mode", "metadata", "created_at", "updated_at") VALUES (1, 0.0, 0.25, 0.73875, 'exploring', '{"move":{"from":{"row":2,"col":3},"to":{"row":3,"col":2},"captured":[]},"predicted_score":0}', '2026-06-10 16:35:23.805721', '2026-06-10 16:35:23.805721') RETURNING "id"