backend/app/serializers/game_serializer.rb

SELECT "moves".* FROM "moves" WHERE "moves"."game_id" = 1 ORDER BY "moves"."created_at" ASC
---
  def as_json(*)
    {
      id: @game.id,
      board_state: @game.board_state,
      status: @game.status,
      current_turn: @game.current_turn,
      winner: @game.winner,
      moves: @game.moves.order(:created_at).map do |move|