backend/app/controllers/api/v1/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1
---
      def play
        game = Game.find(params[:id])

SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1
---
      def finish
        game = Game.find(params[:id])